Revit 2027 API
PropertySetElement.GetEmbodiedCarbonAsset Method
 Gets a copy of the EmbodiedCarbonAsset.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public EmbodiedCarbonAsset GetEmbodiedCarbonAsset()
Public Function GetEmbodiedCarbonAsset As EmbodiedCarbonAsset
public:
EmbodiedCarbonAsset^ GetEmbodiedCarbonAsset()
member GetEmbodiedCarbonAsset : unit -> EmbodiedCarbonAsset
Return Value
EmbodiedCarbonAsset
See Also
Reference
PropertySetElement Class
Autodesk.Revit.DB Namespace